app/controllers/reviews_controller.rb

SELECT "reviews".* FROM "reviews"
---
    def index
        render json: Review.all

UPDATE "reviews" SET "comment" = ?, "rating" = ?, "updated_at" = ? WHERE "reviews"."id" = ?  [["comment", "waffle"], ["rating", 3], ["updated_at", "2022-10-27 23:59:31.691571"], ["id", 7]]
---
    def update
        @review.update!(review_params)

INSERT INTO "reviews" ("user_id", "restaurant_id", "comment", "rating", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", 1], ["restaurant_id", 2], ["comment", "adfadf"], ["rating", 5], ["created_at", "2022-10-27 22:52:25.067199"], ["updated_at", "2022-10-27 22:52:25.067199"]]
---
    def create
        review = Review.create!(review_params)