app/controllers/users_controller.rb

def create
  user = User.create!(user_params)
---
INSERT INTO "users" ("username", "password_digest", "name", "image_url", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["username", "henn"], ["password_digest", "[FILTERED]"], ["name", "Connor"], ["image_url", nil], ["created_at", "2022-10-26 19:42:53.554560"], ["updated_at", "2022-10-26 19:42:53.554560"]]